; ModuleID = 'xdp_echo.c'
source_filename = "xdp_echo.c"
target datalayout = "e-m:e-p:64:64-i64:64-i128:128-n32:64-S128"
target triple = "bpf"

%struct.bpf_map_def = type { i32, i32, i32, i32, i32 }
%struct.xdp_md = type { i32, i32, i32, i32, i32 }
%struct.hdr_cursor = type { i8* }
%struct.ethhdr = type { [6 x i8], [6 x i8], i16 }
%struct.iphdr = type { i8, i8, i16, i16, i16, i8, i8, i16, %union.anon }
%union.anon = type { %struct.anon }
%struct.anon = type { i32, i32 }
%struct.tcphdr = type { i16, i16, i32, i32, i16, i16, i16, i16 }
%struct.udphdr = type { i16, i16, i16, i16 }

@xsks_map = dso_local global %struct.bpf_map_def { i32 17, i32 4, i32 4, i32 64, i32 0 }, section "maps", align 4, !dbg !0
@xdp_puerto_map = dso_local global %struct.bpf_map_def { i32 2, i32 4, i32 4, i32 2, i32 0 }, section "maps", align 4, !dbg !53
@__const.xdp_echo_prog.____fmt = private unnamed_addr constant [10 x i8] c"PUERTO:%d\00", align 1
@__const.xdp_echo_prog.____fmt.3 = private unnamed_addr constant [10 x i8] c"TCPUERTO\0A\00", align 1
@_license = dso_local global [4 x i8] c"GPL\00", section "license", align 1, !dbg !63
@llvm.compiler.used = appending global [4 x i8*] [i8* getelementptr inbounds ([4 x i8], [4 x i8]* @_license, i32 0, i32 0), i8* bitcast (i32 (%struct.xdp_md*)* @xdp_echo_prog to i8*), i8* bitcast (%struct.bpf_map_def* @xdp_puerto_map to i8*), i8* bitcast (%struct.bpf_map_def* @xsks_map to i8*)], section "llvm.metadata"

; Function Attrs: nounwind

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "xsks_map", scope: !2, file: !3, line: 156, type: !55, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !45, globals: !52, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "xdp_echo.c", directory: "/home/amartin/tfg/advanced03-AF_XDP", checksumkind: CSK_MD5, checksum: "c9c34347741731ccbc2fa651ade461e5")
!4 = !{!5, !14}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "xdp_action", file: !6, line: 2845, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "../headers/linux/bpf.h", directory: "/home/amartin/tfg/advanced03-AF_XDP", checksumkind: CSK_MD5, checksum: "db1ce4e5e29770657167bc8f57af9388")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13}
!9 = !DIEnumerator(name: "XDP_ABORTED", value: 0)
!10 = !DIEnumerator(name: "XDP_DROP", value: 1)
!11 = !DIEnumerator(name: "XDP_PASS", value: 2)
!12 = !DIEnumerator(name: "XDP_TX", value: 3)
!13 = !DIEnumerator(name: "XDP_REDIRECT", value: 4)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !15, line: 28, baseType: !7, size: 32, elements: !16)
!15 = !DIFile(filename: "/usr/include/linux/in.h", directory: "", checksumkind: CSK_MD5, checksum: "078a32220dc819f6a7e2ea3cecc4e133")
!16 = !{!17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44}
!17 = !DIEnumerator(name: "IPPROTO_IP", value: 0)
!18 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1)
!19 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2)
!20 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4)
!21 = !DIEnumerator(name: "IPPROTO_TCP", value: 6)
!22 = !DIEnumerator(name: "IPPROTO_EGP", value: 8)
!23 = !DIEnumerator(name: "IPPROTO_PUP", value: 12)
!24 = !DIEnumerator(name: "IPPROTO_UDP", value: 17)
!25 = !DIEnumerator(name: "IPPROTO_IDP", value: 22)
!26 = !DIEnumerator(name: "IPPROTO_TP", value: 29)
!27 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33)
!28 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41)
!29 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46)
!30 = !DIEnumerator(name: "IPPROTO_GRE", value: 47)
!31 = !DIEnumerator(name: "IPPROTO_ESP", value: 50)
!32 = !DIEnumerator(name: "IPPROTO_AH", value: 51)
!33 = !DIEnumerator(name: "IPPROTO_MTP", value: 92)
!34 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94)
!35 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98)
!36 = !DIEnumerator(name: "IPPROTO_PIM", value: 103)
!37 = !DIEnumerator(name: "IPPROTO_COMP", value: 108)
!38 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132)
!39 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136)
!40 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137)
!41 = !DIEnumerator(name: "IPPROTO_ETHERNET", value: 143)
!42 = !DIEnumerator(name: "IPPROTO_RAW", value: 255)
!43 = !DIEnumerator(name: "IPPROTO_MPTCP", value: 262)
!44 = !DIEnumerator(name: "IPPROTO_MAX", value: 263)
!45 = !{!46, !47, !48, !51}
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!47 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !49, line: 24, baseType: !50)
!49 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "", checksumkind: CSK_MD5, checksum: "b810f270733e106319b67ef512c6246e")
!50 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !49, line: 27, baseType: !7)
!52 = !{!0, !53, !63, !69, !77, !85}
!53 = !DIGlobalVariableExpression(var: !54, expr: !DIExpression())
!54 = distinct !DIGlobalVariable(name: "xdp_puerto_map", scope: !2, file: !3, line: 163, type: !55, isLocal: false, isDefinition: true)
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_map_def", file: !56, line: 33, size: 160, elements: !57)
!56 = !DIFile(filename: "../libbpf/src//build/usr/include/bpf/bpf_helpers.h", directory: "/home/amartin/tfg/advanced03-AF_XDP", checksumkind: CSK_MD5, checksum: "9e37b5f46a8fb7f5ed35ab69309bf15d")
!57 = !{!58, !59, !60, !61, !62}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !55, file: !56, line: 34, baseType: !7, size: 32)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !55, file: !56, line: 35, baseType: !7, size: 32, offset: 32)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !55, file: !56, line: 36, baseType: !7, size: 32, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !55, file: !56, line: 37, baseType: !7, size: 32, offset: 96)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !55, file: !56, line: 38, baseType: !7, size: 32, offset: 128)
!63 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression())
!64 = distinct !DIGlobalVariable(name: "_license", scope: !2, file: !3, line: 271, type: !65, isLocal: false, isDefinition: true)
!65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 32, elements: !67)
!66 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!67 = !{!68}
!68 = !DISubrange(count: 4)
!69 = !DIGlobalVariableExpression(var: !70, expr: !DIExpression())
!70 = distinct !DIGlobalVariable(name: "bpf_map_lookup_elem", scope: !2, file: !71, line: 33, type: !72, isLocal: true, isDefinition: true)
!71 = !DIFile(filename: "../libbpf/src//build/usr/include/bpf/bpf_helper_defs.h", directory: "/home/amartin/tfg/advanced03-AF_XDP", checksumkind: CSK_MD5, checksum: "2601bcf9d7985cb46bfbd904b60f5aaf")
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DISubroutineType(types: !74)
!74 = !{!46, !46, !75}
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!77 = !DIGlobalVariableExpression(var: !78, expr: !DIExpression())
!78 = distinct !DIGlobalVariable(name: "bpf_trace_printk", scope: !2, file: !71, line: 152, type: !79, isLocal: true, isDefinition: true)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DISubroutineType(types: !81)
!81 = !{!82, !83, !51, null}
!82 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !66)
!85 = !DIGlobalVariableExpression(var: !86, expr: !DIExpression())
!86 = distinct !DIGlobalVariable(name: "bpf_redirect_map", scope: !2, file: !71, line: 1254, type: !87, isLocal: true, isDefinition: true)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DISubroutineType(types: !89)
!89 = !{!82, !46, !51, !90}
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !49, line: 31, baseType: !91)
!91 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!92 = !{i32 7, !"Dwarf Version", i32 5}
!93 = !{i32 2, !"Debug Info Version", i32 3}
!94 = !{i32 1, !"wchar_size", i32 4}
!95 = !{i32 7, !"frame-pointer", i32 2}
!96 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!97 = distinct !DISubprogram(name: "xdp_echo_prog", scope: !3, file: !3, line: 171, type: !98, scopeLine: 172, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !108)
!98 = !DISubroutineType(types: !99)
!99 = !{!82, !100}
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xdp_md", file: !6, line: 2856, size: 160, elements: !102)
!102 = !{!103, !104, !105, !106, !107}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !101, file: !6, line: 2857, baseType: !51, size: 32)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !101, file: !6, line: 2858, baseType: !51, size: 32, offset: 32)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !101, file: !6, line: 2859, baseType: !51, size: 32, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !101, file: !6, line: 2861, baseType: !51, size: 32, offset: 96)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "rx_queue_index", scope: !101, file: !6, line: 2862, baseType: !51, size: 32, offset: 128)
!108 = !{!109, !110, !111, !115, !116, !117, !131, !161, !170, !192, !193, !194, !195, !197, !198, !199, !202, !207, !212, !214, !218, !221, !224}
!109 = !DILocalVariable(name: "ctx", arg: 1, scope: !97, file: !3, line: 171, type: !100)
!110 = !DILocalVariable(name: "index", scope: !97, file: !3, line: 174, type: !82)
!111 = !DILocalVariable(name: "nh", scope: !97, file: !3, line: 175, type: !112)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hdr_cursor", file: !3, line: 16, size: 64, elements: !113)
!113 = !{!114}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !112, file: !3, line: 17, baseType: !46, size: 64)
!115 = !DILocalVariable(name: "data_end", scope: !97, file: !3, line: 176, type: !46)
!116 = !DILocalVariable(name: "data", scope: !97, file: !3, line: 177, type: !46)
!117 = !DILocalVariable(name: "eth", scope: !97, file: !3, line: 178, type: !118)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethhdr", file: !120, line: 168, size: 112, elements: !121)
!120 = !DIFile(filename: "/usr/include/linux/if_ether.h", directory: "", checksumkind: CSK_MD5, checksum: "ab0320da726e75d904811ce344979934")
!121 = !{!122, !127, !128}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "h_dest", scope: !119, file: !120, line: 169, baseType: !123, size: 48)
!123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 48, elements: !125)
!124 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!125 = !{!126}
!126 = !DISubrange(count: 6)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "h_source", scope: !119, file: !120, line: 170, baseType: !123, size: 48, offset: 48)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "h_proto", scope: !119, file: !120, line: 171, baseType: !129, size: 16, offset: 96)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !130, line: 25, baseType: !48)
!130 = !DIFile(filename: "/usr/include/linux/types.h", directory: "", checksumkind: CSK_MD5, checksum: "52ec79a38e49ac7d1dc9e146ba88a7b1")
!131 = !DILocalVariable(name: "iph", scope: !97, file: !3, line: 179, type: !132)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iphdr", file: !134, line: 87, size: 160, elements: !135)
!134 = !DIFile(filename: "/usr/include/linux/ip.h", directory: "", checksumkind: CSK_MD5, checksum: "042b09a58768855e3578a0a8eba49be7")
!135 = !{!136, !138, !139, !140, !141, !142, !143, !144, !145, !147}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "ihl", scope: !133, file: !134, line: 89, baseType: !137, size: 4, flags: DIFlagBitField, extraData: i64 0)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !49, line: 21, baseType: !124)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !133, file: !134, line: 90, baseType: !137, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !133, file: !134, line: 97, baseType: !137, size: 8, offset: 8)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !133, file: !134, line: 98, baseType: !129, size: 16, offset: 16)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !133, file: !134, line: 99, baseType: !129, size: 16, offset: 32)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "frag_off", scope: !133, file: !134, line: 100, baseType: !129, size: 16, offset: 48)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !133, file: !134, line: 101, baseType: !137, size: 8, offset: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !133, file: !134, line: 102, baseType: !137, size: 8, offset: 72)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !133, file: !134, line: 103, baseType: !146, size: 16, offset: 80)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sum16", file: !130, line: 31, baseType: !48)
!147 = !DIDerivedType(tag: DW_TAG_member, scope: !133, file: !134, line: 104, baseType: !148, size: 64, offset: 96)
!148 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !133, file: !134, line: 104, size: 64, elements: !149)
!149 = !{!150, !156}
!150 = !DIDerivedType(tag: DW_TAG_member, scope: !148, file: !134, line: 104, baseType: !151, size: 64)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !148, file: !134, line: 104, size: 64, elements: !152)
!152 = !{!153, !155}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !151, file: !134, line: 104, baseType: !154, size: 32)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !130, line: 27, baseType: !51)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !151, file: !134, line: 104, baseType: !154, size: 32, offset: 32)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "addrs", scope: !148, file: !134, line: 104, baseType: !157, size: 64)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !148, file: !134, line: 104, size: 64, elements: !158)
!158 = !{!159, !160}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !157, file: !134, line: 104, baseType: !154, size: 32)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !157, file: !134, line: 104, baseType: !154, size: 32, offset: 32)
!161 = !DILocalVariable(name: "udph", scope: !97, file: !3, line: 180, type: !162)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "udphdr", file: !164, line: 23, size: 64, elements: !165)
!164 = !DIFile(filename: "/usr/include/linux/udp.h", directory: "", checksumkind: CSK_MD5, checksum: "53c0d42e1bf6d93b39151764be2d20fb")
!165 = !{!166, !167, !168, !169}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !163, file: !164, line: 24, baseType: !129, size: 16)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !163, file: !164, line: 25, baseType: !129, size: 16, offset: 16)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !163, file: !164, line: 26, baseType: !129, size: 16, offset: 32)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !163, file: !164, line: 27, baseType: !146, size: 16, offset: 48)
!170 = !DILocalVariable(name: "tcph", scope: !97, file: !3, line: 181, type: !171)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tcphdr", file: !173, line: 25, size: 160, elements: !174)
!173 = !DIFile(filename: "/usr/include/linux/tcp.h", directory: "", checksumkind: CSK_MD5, checksum: "8d74bf2133e7b3dab885994b9916aa13")
!174 = !{!175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !172, file: !173, line: 26, baseType: !129, size: 16)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !172, file: !173, line: 27, baseType: !129, size: 16, offset: 16)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !172, file: !173, line: 28, baseType: !154, size: 32, offset: 32)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "ack_seq", scope: !172, file: !173, line: 29, baseType: !154, size: 32, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "res1", scope: !172, file: !173, line: 31, baseType: !48, size: 4, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "doff", scope: !172, file: !173, line: 32, baseType: !48, size: 4, offset: 100, flags: DIFlagBitField, extraData: i64 96)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "fin", scope: !172, file: !173, line: 33, baseType: !48, size: 1, offset: 104, flags: DIFlagBitField, extraData: i64 96)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "syn", scope: !172, file: !173, line: 34, baseType: !48, size: 1, offset: 105, flags: DIFlagBitField, extraData: i64 96)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "rst", scope: !172, file: !173, line: 35, baseType: !48, size: 1, offset: 106, flags: DIFlagBitField, extraData: i64 96)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "psh", scope: !172, file: !173, line: 36, baseType: !48, size: 1, offset: 107, flags: DIFlagBitField, extraData: i64 96)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "ack", scope: !172, file: !173, line: 37, baseType: !48, size: 1, offset: 108, flags: DIFlagBitField, extraData: i64 96)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "urg", scope: !172, file: !173, line: 38, baseType: !48, size: 1, offset: 109, flags: DIFlagBitField, extraData: i64 96)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "ece", scope: !172, file: !173, line: 39, baseType: !48, size: 1, offset: 110, flags: DIFlagBitField, extraData: i64 96)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "cwr", scope: !172, file: !173, line: 40, baseType: !48, size: 1, offset: 111, flags: DIFlagBitField, extraData: i64 96)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !172, file: !173, line: 55, baseType: !129, size: 16, offset: 112)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !172, file: !173, line: 56, baseType: !146, size: 16, offset: 128)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "urg_ptr", scope: !172, file: !173, line: 57, baseType: !129, size: 16, offset: 144)
!192 = !DILocalVariable(name: "action", scope: !97, file: !3, line: 183, type: !51)
!193 = !DILocalVariable(name: "nh_type", scope: !97, file: !3, line: 184, type: !82)
!194 = !DILocalVariable(name: "nh_proto", scope: !97, file: !3, line: 189, type: !82)
!195 = !DILocalVariable(name: "puerto1", scope: !97, file: !3, line: 191, type: !196)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!197 = !DILocalVariable(name: "key_puerto", scope: !97, file: !3, line: 192, type: !82)
!198 = !DILocalVariable(name: "valor_puerto", scope: !97, file: !3, line: 194, type: !82)
!199 = !DILocalVariable(name: "l", scope: !200, file: !3, line: 200, type: !82)
!200 = distinct !DILexicalBlock(scope: !201, file: !3, line: 199, column: 31)
!201 = distinct !DILexicalBlock(scope: !97, file: !3, line: 199, column: 6)
!202 = !DILocalVariable(name: "____fmt", scope: !203, file: !3, line: 205, type: !204)
!203 = distinct !DILexicalBlock(scope: !200, file: !3, line: 205, column: 3)
!204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 80, elements: !205)
!205 = !{!206}
!206 = !DISubrange(count: 10)
!207 = !DILocalVariable(name: "____fmt", scope: !208, file: !3, line: 206, type: !209)
!208 = distinct !DILexicalBlock(scope: !200, file: !3, line: 206, column: 3)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 64, elements: !210)
!210 = !{!211}
!211 = !DISubrange(count: 8)
!212 = !DILocalVariable(name: "____fmt", scope: !213, file: !3, line: 207, type: !209)
!213 = distinct !DILexicalBlock(scope: !200, file: !3, line: 207, column: 3)
!214 = !DILocalVariable(name: "____fmt", scope: !215, file: !3, line: 210, type: !204)
!215 = distinct !DILexicalBlock(scope: !216, file: !3, line: 210, column: 4)
!216 = distinct !DILexicalBlock(scope: !217, file: !3, line: 208, column: 46)
!217 = distinct !DILexicalBlock(scope: !200, file: !3, line: 208, column: 7)
!218 = !DILocalVariable(name: "l", scope: !219, file: !3, line: 217, type: !82)
!219 = distinct !DILexicalBlock(scope: !220, file: !3, line: 216, column: 31)
!220 = distinct !DILexicalBlock(scope: !97, file: !3, line: 216, column: 6)
!221 = !DILocalVariable(name: "aux", scope: !222, file: !3, line: 224, type: !51)
!222 = distinct !DILexicalBlock(scope: !223, file: !3, line: 222, column: 42)
!223 = distinct !DILexicalBlock(scope: !219, file: !3, line: 222, column: 6)
!224 = !DILocalVariable(name: "aux2", scope: !222, file: !3, line: 227, type: !48)
!225 = !DILocation(line: 0, scope: !97)
!226 = !DILocation(line: 174, column: 19, scope: !97)
!227 = !{!228, !229, i64 16}
!228 = !{!"xdp_md", !229, i64 0, !229, i64 4, !229, i64 8, !229, i64 12, !229, i64 16}
!229 = !{!"int", !230, i64 0}
!230 = !{!"omnipotent char", !231, i64 0}
!231 = !{!"Simple C/C++ TBAA"}
!232 = !DILocation(line: 176, column: 39, scope: !97)
!233 = !{!228, !229, i64 4}
!234 = !DILocation(line: 176, column: 28, scope: !97)
!235 = !DILocation(line: 176, column: 20, scope: !97)
!236 = !DILocation(line: 177, column: 34, scope: !97)
!237 = !{!228, !229, i64 0}
!238 = !DILocation(line: 177, column: 23, scope: !97)
!239 = !DILocation(line: 177, column: 15, scope: !97)
!240 = !DILocalVariable(name: "nh", arg: 1, scope: !241, file: !3, line: 46, type: !244)
!241 = distinct !DISubprogram(name: "parse_ethhdr", scope: !3, file: !3, line: 46, type: !242, scopeLine: 47, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !246)
!242 = !DISubroutineType(types: !243)
!243 = !{!82, !244, !46, !245}
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!246 = !{!240, !247, !248, !249, !250}
!247 = !DILocalVariable(name: "data_end", arg: 2, scope: !241, file: !3, line: 46, type: !46)
